package com.after.today;

public  class MapList {
	public static int [][][] map={
		  {
			//0表示没东西,1为墙,2为目标地点3为路,4为箱子,6为玩家
			//看出来了没有,把我刚刚的解释对号入座，就是第一关的平面图了,是不是很简单😃
			//你应该相信for的强大😏
			{0,0,1,1,1,0,0,0},
			{0,0,1,2,1,0,0,0},
			{0,0,1,3,1,1,1,1},
			{1,1,1,4,3,4,2,1},
			{1,2,3,4,6,1,1,1},
			{1,1,1,1,4,1,0,0},
			{0,0,0,1,2,1,0,0},
			{0,0,0,1,1,1,0,0}
		  },
			
		 {
			//第二关地图
			{1,1,1,1,1,0,0,0,0},
			{1,6,3,3,1,0,0,0,0},
			{1,3,4,4,1,0,1,1,1},
			{1,3,4,3,1,0,1,2,1},
			{1,1,1,3,1,1,1,2,1},
			{0,1,1,3,3,3,3,2,1},
			{0,1,3,3,3,1,3,3,1},
			{0,1,3,3,3,1,1,1,1},
			{0,1,1,1,1,1,0,0,0}
		 }
			};

public static int count=map.length;//关卡数量

public static int getCount(){
	return count;
}

public static int[][] getMap(int grade){
	int[][]temp;
	if(grade>=0&&grade<count)//判断关卡
		temp=map[grade];
	else
		temp=map[0];//返回第一关
	return temp;
}

}
